In [1]:
from lib.climber_class import *

# User

We need to create a user with this same route features
- Grade
- Location
- Cluster
- Heigh

#### Climber atributes

In [2]:
climber_1 = Climber('jordi',44,3,['rum','eidas','ajs niod'],165)
climber_2 = Climber()
display(climber_1.get_data())
display(climber_2.get_data())

Climber class initialized
Climber class initialized

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,0,jordi,0,6b+/6c,44,3,rum,eidas,ajs niod,165

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,1,climber1,0,7b/+,54,2,esp,montserrat,agulla del senglar,170

In [6]:
climber_1.get_data().grade[0]

44

In [3]:
climber_1.set_attributes(grade = 29)
climber_2.set_attributes(grade_range = 1)
display(climber_1.get_data())
display(climber_2.get_data())

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,0,jordi,0,5,29,3,rum,eidas,ajs niod,165

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,1,climber1,0,7b/+,54,1,esp,montserrat,agulla del senglar,170

#### For routes

In [4]:
routes = pd.read_csv('../data/routes_rated.csv',low_memory=False, index_col=0)

In [5]:
climber_1.add_route_liked(routes.iloc[[13403]])
climber_1.add_route_not_liked(routes.tail(2))
climber_1.add_route(routes.head(1))
display("Routes liked:",climber_1.get_routes_liked())
print()
print()
display("Routes not liked:",climber_1.get_routes_climbed())

'Routes liked:'

,name_id,country,crag,sector,name,tall_recommend_sum,grade_mean,cluster,rating_tot,liked
13403,13403,esp,cocentaina,mas de la penya,demolition man,0,46.75,3,-0.109745,Yes

'Routes not liked:'

,name_id,country,crag,sector,name,tall_recommend_sum,grade_mean,cluster,rating_tot,liked
13403,13403,esp,cocentaina,mas de la penya,demolition man,0,46.75,3,-0.109745,Yes
0,0,and,montserrat,prohibitivo,diagonal de la x,-1,49.25,3,-0.045211,N/A
55856,55856,zaf,van stadens,cleopatra wall,tekel,0,44.00,2,0.439815,No
55857,55857,zaf,waterval boven,baboon buttress,pretenders,0,49.00,2,0.425427,No

Is route already in?

In [6]:
climber_1.add_route_not_liked(routes.tail(100))

In [7]:
climber_1.add_route_liked(routes.head(100))

#### For clusters

In [8]:
climber_1.cluster

[10, -3, -11, 8, -4, -2, 1, 0, 0]

In [9]:
climber_1.get_cluster_order()

[0, 3, 6, 7, 8, 5, 1, 4, 2]

In [10]:
lst = climber_1.get_cluster_order()
[lst[len(lst)-idx-1] for idx in range(len(lst))]

[2, 4, 1, 5, 8, 7, 6, 3, 0]

In [11]:
len(lst)

9

In [12]:
climber_1.add_route_liked(routes.head(1000))

In [13]:
climber_1.cluster

[121, 148, 569, 91, 18, 1, 20, 11, 20]

In [14]:
climber_1.get_cluster_order()

[2, 1, 0, 3, 6, 8, 4, 7, 5]

In [15]:
# climber_1.clear_routes()
# display(climber_1.get_routes_climbed())

# From class to Mongo

In [1]:
from lib.mongo_jor import *

In [3]:
import pymongo

In [4]:
pymongo.__version__

'4.1.1'

In [17]:
delete_db()

In [18]:
list_climbers()

Empty DataFrame
Columns: [climber_id, name]
Index: []

In [19]:
save_climber(climber_1)

Created new climber

In [20]:
list_climbers()

   climber_id   name
0           0  jordi

In [22]:
climber_1 = load_climber(0)
climber_1.get_data()

Climber class initialized

,climber_id,name,ascents,grade_fra,grade,grade_range,country,crag,sector,height
0,0,jordi,0,5,29,3,rum,eidas,ajs niod,165

In [23]:
climber_1.get_cluster()

[121, 148, 569, 91, 18, 1, 20, 11, 20]

In [24]:
climber_1.set_cluster([6571, 0, 30489, 0, 0, 504, 1177, 1354, 1779])

In [25]:
save_climber(climber_1)

Climber already exists on the database
climber successfully updated

In [27]:
climber_2 = load_climber(0)
climber_2.get_cluster()

Climber class initialized

[6571, 0, 30489, 0, 0, 504, 1177, 1354, 1779]

In [28]:
climber_2.get_routes_climbed()

,name_id,country,crag,sector,name,tall_recommend_sum,grade_mean,cluster,rating_tot,liked
0,13403,esp,cocentaina,mas de la penya,demolition man,0,46.750000,3,-0.109745,Yes
1,0,and,montserrat,prohibitivo,diagonal de la x,-1,49.250000,3,-0.045211,Yes
2,1,and,montserrat,prohibitivo,mehir,-1,49.000000,2,0.116464,Yes
3,2,and,montserrat,prohibitivo,pas de la discordia,0,49.000000,2,0.178722,Yes
4,3,and,tartareu,bombo suis,tenedor libre,0,44.333333,3,0.158449,Yes
...,...,...,...,...,...,...,...,...,...,...
1097,996,aus,nowra,thompsons point,hang on,0,33.176471,1,-0.077977,Yes
1098,997,aus,nowra,thompsons point,hard knee,0,36.000000,2,0.087196,Yes
1099,998,aus,nowra,thompsons point,helensburgh homo,0,51.000000,2,-0.045211,Yes
1100,999,aus,nowra,thompsons point,hide the salami,-1,51.000000,1,-0.021273,Yes
0,0,and,montserrat,prohibitivo,diagonal de la x,-1,49.250000,3,-0.045211,N/A

In [29]:
climber_1.get_routes_climbed()

,name_id,country,crag,sector,name,tall_recommend_sum,grade_mean,cluster,rating_tot,liked
0,13403,esp,cocentaina,mas de la penya,demolition man,0,46.750000,3,-0.109745,Yes
1,0,and,montserrat,prohibitivo,diagonal de la x,-1,49.250000,3,-0.045211,Yes
2,1,and,montserrat,prohibitivo,mehir,-1,49.000000,2,0.116464,Yes
3,2,and,montserrat,prohibitivo,pas de la discordia,0,49.000000,2,0.178722,Yes
4,3,and,tartareu,bombo suis,tenedor libre,0,44.333333,3,0.158449,Yes
...,...,...,...,...,...,...,...,...,...,...
1097,996,aus,nowra,thompsons point,hang on,0,33.176471,1,-0.077977,Yes
1098,997,aus,nowra,thompsons point,hard knee,0,36.000000,2,0.087196,Yes
1099,998,aus,nowra,thompsons point,helensburgh homo,0,51.000000,2,-0.045211,Yes
1100,999,aus,nowra,thompsons point,hide the salami,-1,51.000000,1,-0.021273,Yes
0,0,and,montserrat,prohibitivo,diagonal de la x,-1,49.250000,3,-0.045211,N/A